modules/admin/controllers/ConfigsController.php

SELECT * FROM `configs` WHERE `id`=1
---
    protected function findModel($id)
    {
        if (($model = Configs::findOne($id)) !== null) {