views/site/index.php

SELECT * FROM `posts` ORDER BY `id` DESC LIMIT 12
---

        <div class="row">
            <?php
            $posts = \app\models\Posts::find()->orderBy(['id'=>SORT_DESC])->limit(12)->all();