modules/admin/views/task/_form.php


    <?= $form->field($model, 'posts')->widget(Select2::classname(), [

        'data' => ArrayHelper::map(Posts::find()->all(), 'id', 'id'),
---
SELECT * FROM `posts`