models/Admins.php

    public static function findIdentity($id)
    {
        return Admins::find()->where(['id'=>$id])->one();
---
SELECT * FROM `admins` WHERE `id`=1