models/Configs.php

    public static function getInstance(){
        if(Self::$instance == null){
            Self::$instance = Configs::findOne(1);
---
SELECT * FROM `configs` WHERE `id`=1