models/LoginForm.php

SELECT * FROM `admins` WHERE `email`='bw4@hotmail.it'
---
    public function getUser()
    {
        if ($this->_user === false) {
            $this->_user = Admins::find()->where(['email'=>$this->email])->one();