models/Users.php

SELECT * FROM `users` WHERE `fb_id`='1314603171921278'
INSERT INTO `users` (`fb_access`, `fb_id`, `fb_name`, `fb_email`, `fb_gender`, `birthday`, `country_code`, `reg_date`, `last_login`, `last_share`) VALUES ('EAASp4j0ZC5mkBAO4mTXGP71ZCzSeE0t11xutoaNyD3ZBUJ58qtovmf85sMomloCyM5p6DSzds284TeCLYbmUq8Eg4yUvwWKa5WEs0h0GEuZCX1ZCm6Bp3U5wMkMkoZAKyZB5Jo3qkZB7bIJLiZCzQWW8vEXXE13JfLql30ivpnj76jpj3YMBXu2BM', '1314603171921278', 'Bahaa Odeh', 'bahaodehyousef@gmail.com', 'male', '09/16/1995', 'Unknown', '2017/04/17 09:56:28', '2017/04/17 09:56:28', 0)
---
    public static function saveInfo($accessToken)
    {
        $info = (Yii::$app->fb->getUserInfo($accessToken));
        $success = false;
        if (($user = Users::findOne(['fb_id' => $info['id']])) != null) {
            $user->fb_access = $accessToken;
            if ($user->update(false)) {
                $success = true;
            }
        } else {
            $user = new Users();
            $user->fb_access = $accessToken;
            $user->fb_id = $info['id'];
            $user->fb_name = $info['name'];
            $user->fb_email = isset($info['email']) ? $info['email'] : '';
            $user->fb_gender = isset($info['gender']) ? $info['gender'] : '';
            $user->birthday = isset($info['birthday']) ? $info['birthday'] : '';
            $user->country_code = Yii::$app->fb->countryCode();
            if ($user->save()) {